#+BLOG: wurly-blog
#+POSTID: 2107
#+ORG2BLOG:
#+DATE: [2026-04-25 Sat 13:59]
#+OPTIONS: toc:nil num:nil todo:nil pri:nil tags:nil ^:nil
#+CATEGORY: Ubuntu
#+TAGS: 
#+DESCRIPTION:
#+TITLE: Ubuntu 24.04 から 26.04 LTS へのアップグレード

** ディスク空き容量

#+begin_src bash
df -h /
#+end_src

#+RESULTS:
: Filesystem      Size  Used Avail Use% Mounted on
: /dev/nvme0n1p5  458G  296G  139G  69% /

15GB 以上の空きが必要です。

** NVIDIA ドライバーバージョン

#+begin_src bash
nvidia-smi --query-gpu=driver_version --format=csv,noheader
#+end_src

#+RESULTS:
: 560.35.05

470 より新しいバージョンであることを確認します。

* 結果確認

#+begin_src bash
cat /etc/lsb-release
#+end_src

#+RESULTS:
: DISTRIB_ID=Ubuntu
: DISTRIB_RELEASE=26.04
: DISTRIB_CODENAME=resolute
: DISTRIB_DESCRIPTION="Ubuntu 26.04 LTS"

無事に Ubuntu 26.04 LTS へのアップグレードが完了しました。
